{
  "Family": [
    {"title":"Frozen","clue":"Woman weaponizes weather during an emotional spiral."},
    {"title":"Toy Story","clue":"Plastic cowboy gets jealous of a shiny spaceman."},
    {"title":"The Lion King","clue":"Uncle throws nephew's dad off a cliff to steal the family business."},
    {"title":"Moana","clue":"Teen ignores curfew, steals a boat, and returns a heart."},
    {"title":"Shrek","clue":"Introverted swamp guy is bullied into a rescue mission."},
    {"title":"The Incredibles","clue":"Dad's midlife crisis leads to mass property damage."},
    {"title":"Up","clue":"Elderly widower airlifts his house and kidnaps a Boy Scout."},
    {"title":"Inside Out","clue":"Girl's emotions unionize and stage a hostile takeover."},
    {"title":"WALL-E","clue":"Trash robot soft-launches humanity's comeback."},
    {"title":"Coco","clue":"Boy trespasses in the afterlife to jam with ancestors."},
    {"title":"Zootopia","clue":"Rabbit cop uncovers conspiracy with a fox consultant."},
    {"title":"Big Hero 6","clue":"Teen builds illegal nurse robot and accidentally saves a city."},
    {"title":"Monsters Inc","clue":"Energy company pivots from screams to giggles."},
    {"title":"Ratatouille","clue":"Rat becomes head chef by puppeteering a human."},
    {"title":"Cars","clue":"Hotshot gets court-ordered community service in a town with no exit."},
    {"title":"A Bug's Life","clue":"Ant fails at lying, starts a labor movement."},
    {"title":"Brave","clue":"Teen curses her mom to avoid talking about feelings."},
    {"title":"The Princess and the Frog","clue":"Waitress kisses frog, gets stuck in amphibian purgatory."},
    {"title":"Tangled","clue":"Kidnapped girl escapes with man with suspiciously good hair."},
    {"title":"How to Train Your Dragon","clue":"Teen domesticates apex predator and rewrites national policy."},
    {"title":"Paddington","clue":"Immigrant bear commits polite crimes and improves Britain."},
    {"title":"The LEGO Movie","clue":"Construction worker mistaken for prophesied glue fighter."},
    {"title":"Despicable Me","clue":"Villain adopts kids and becomes dad of the year."},
    {"title":"Home Alone","clue":"Child engineers OSHA violations instead of calling 911."},
    {"title":"Finding Nemo","clue":"Dad crosses ocean to save son kidnapped by dentist."},
    {"title":"Mulan","clue":"Girl joins military to stop her dad from getting a draft notice."},
    {"title":"Aladdin","clue":"Homeless teen uses a magic lamp to catfish a princess."},
    {"title":"Kung Fu Panda","clue":"Lazy bear becomes martial arts master because he's hungry."},
    {"title":"Beauty and the Beast","clue":"Girl with Stockholm syndrome falls for a buffalo."},
    {"title":"Hercules","clue":"Nephew of the boss loses immortality and gym-grinds to get it back."},
    {"title":"Tarzan","clue":"Orphan raised by gorillas becomes woman's science project."},
    {"title":"Lilo & Stitch","clue":"Girl adopts blue genetic experiment she thinks is a weird dog."},
    {"title":"Megamind","clue":"Villain kills rival, gets bored, and manufactures a hero."},
    {"title":"Ice Age","clue":"Squirrel triggers apocalypse chasing snack."},
    {"title":"Madagascar","clue":"Zoo animals stranded on island realize they're made of meat."},
    {"title":"Cinderella","clue":"Orphan exploits seasonal workers to attend a party."},
    {"title":"Peter Pan","clue":"Man-child whisks kids to a magic island to fight one very stressed pirate."},
    {"title":"Pinocchio","clue":"Wooden doll has growth defect triggered by dishonesty."},
    {"title":"Sleeping Beauty","clue":"Teen naps aggressively after sewing accident."},
    {"title":"Snow White","clue":"Woman lives with seven strangers to avoid jealous relative."},
    {"title":"Dumbo","clue":"Elephant with huge ears learns to fly through peer pressure."},
    {"title":"The Little Mermaid","clue":"Teen trades voice for legs to stalk man she met once."},
    {"title":"Wreck-It Ralph","clue":"Demolition worker changes careers and befriends a glitch."},
    {"title":"The Nightmare Before Christmas","clue":"Skeleton tries to colonize a neighboring holiday."},
    {"title":"Mary Poppins","clue":"Nanny uses illegal flying umbrella to fix family."},
    {"title":"The Parent Trap","clue":"Twins commit identity theft to fix their parents' divorce."},
    {"title":"E.T.","clue":"Alien gets left behind, hides in closet, builds long-distance phone."},
    {"title":"Mrs. Doubtfire","clue":"Dad commits fraud and prosthetic crimes to see kids."},
    {"title":"Holes","clue":"Juvenile delinquents forced to dig for treasure disguised as character building."},
    {"title":"Finding Dory","clue":"Amnesiac fish reverse-engineers childhood using vibes."},
    {"title":"Elemental","clue":"Fire girl dates water guy and somehow this isn't the dangerous part."},
    {"title":"Bolt","clue":"Dog with delusions of superheroism starts cross-country PR crisis."},
    {"title":"The Croods","clue":"Caveman dad's anxiety outlasts natural selection."},
    {"title":"Minions","clue":"Yellow tic-tacs unionize under chaotic villain."},
    {"title":"The Secret Life of Pets","clue":"Dog has meltdown when roommate moves in."},
    {"title":"The Bad Guys","clue":"Criminal animals attempt rebrand then accidentally improve society."},
    {"title":"Sing","clue":"Koala hosts stressful talent show to fix bankruptcy."},
    {"title":"Sing 2","clue":"Koala lies his way into Vegas-level production with zero permits."},
    {"title":"Puss in Boots","clue":"Cat faces mortality and chooses therapy via adventure."},
    {"title":"Puss in Boots: The Last Wish","clue":"Cat fights death itself over nine-life mismanagement."},
    {"title":"Encanto","clue":"Family refuses therapy until house collapses from generational trauma."},
    {"title":"Onward","clue":"Teen brothers resurrect half a dad and road-trip to fix it."},
    {"title":"Soul","clue":"Musician negotiates with afterlife for a second chance at jazz."},
    {"title":"Turning Red","clue":"Teen girl hits puberty and turns into a giant red panda."},
    {"title":"Abominable","clue":"Girl finds yeti and returns him using violin-powered magic."},
    {"title":"The Good Dinosaur","clue":"Anxious dino befriends feral human child for emotional growth."},
    {"title":"Cloudy With a Chance of Meatballs","clue":"Inventor weaponizes weather into buffet warfare."},
    {"title":"Cloudy with a Chance of Meatballs 2","clue":"Mutant food creatures become emotional support animals."},
    {"title":"Rio","clue":"Captive bird gets kidnapped on vacation and rediscovers flight."},
    {"title":"Rio 2","clue":"Bird family vacations in jungle and meets in-laws from hell."},
    {"title":"Happy Feet","clue":"Tap-dancing penguin embarrasses community until he saves species."},
    {"title":"Happy Feet Two","clue":"Penguins face existential panic via glacier shift."},
    {"title":"Ice Age: The Meltdown","clue":"Mammals outrun climate change via slapstick."},
    {"title":"Ice Age: Dawn of the Dinosaurs","clue":"Mammals outrun dinosaurs via slapstick."},
    {"title":"Ice Age: Continental Drift","clue":"Mammals outrun continental drift via slapstick."},
    {"title":"Ice Age: Collision Course","clue":"Mammals outrun asteroid via slapstick."},
    {"title":"The Peanuts Movie","clue":"Child with anxiety attempts rebrand to impress crush."},
    {"title":"Charlotte's Web","clue":"Pig avoids becoming bacon through PR management."},
    {"title":"Stuart Little","clue":"Family adopts talking mouse without allergy discussions."},
    {"title":"The Iron Giant","clue":"Robot chooses friendship over mass destruction."},
    {"title":"The BFG","clue":"Giant kidnaps child and feeds her dreams like snacks."},
    {"title":"The Lorax","clue":"Orange eco-gremlin lectures capitalist into therapy."},
    {"title":"The Grinch","clue":"Green introvert steals holiday to avoid small talk."},
    {"title":"The Grinch (2018)","clue":"Introvert with trauma rebrands Christmas theft as self-care."},
    {"title":"A Christmas Story","clue":"Child wants gun toy and everyone enables him."},
    {"title":"Jumanji (1995)","clue":"Board game attempts murder via jungle hazards."},
    {"title":"James and the Giant Peach","clue":"Orphan travels with insects due to lack of supervision."},
    {"title":"Matilda (musical)","clue":"Gifted child uses telekinesis to unionize classmates."},
    {"title":"Paddington 2","clue":"Wrongfully jailed bear improves prison through kindness."},
    {"title":"The Sandlot","clue":"Kids form religion around baseball."},
    {"title":"Little Rascals","clue":"Children run misogynistic club, learn feminism by accident."},
    {"title":"The Mighty Ducks","clue":"Community service creates elite youth hockey cult."},
    {"title":"Cheaper by the Dozen","clue":"Parents run social experiment disguised as family."},
    {"title":"Night at the Museum","clue":"Security guard babysits historical chaos nightly."},
    {"title":"A Series of Unfortunate Events","clue":"Orphans outrun actor obsessed with inheritance."},
    {"title":"The Boss Baby","clue":"Suit-wearing infant gaslights entire family."},
    {"title":"Peter Rabbit","clue":"Vegetable thief rabbit escalates feud with landlord."},
    {"title":"The Addams Family","clue":"Kooky family intimidates HOA with vibes."},
    {"title":"Nanny McPhee","clue":"Ugly nanny fixes children until she becomes pretty."},
    {"title":"Annie","clue":"Orphan hustles her way into billionaire household."},
    {"title":"Hook","clue":"Lawyer relearns flying to resolve custody issues."},
    {"title":"The SpongeBob Movie","clue":"Sea sponge steals crown, saves underwater kingdom."},
    {"title":"The SpongeBob Movie: Sponge Out of Water","clue":"Sea sponge time-travels with burger vendor for justice."},
    {"title":"Shaun the Sheep","clue":"Sheep causes city-wide chaos from boredom."},
    {"title":"Chicken Run","clue":"Chickens plan prison escape with claymation grit."},
    {"title":"Coraline","clue":"Girl rejects better parents because buttons are weird."},
    {"title":"The Book of Life","clue":"Man enters underworld to stop arranged marriage."},
    {"title":"A Goofy Movie","clue":"Single dad forces bonding road trip on emo teen."},
    {"title":"Inside Out 2","clue":"Teen emotions unionize during puberty reboot."},
    {"title":"Wish","clue":"Girl weaponizes wishing star to fight her boss."},
    {"title":"Luca","clue":"Sea monsters pass as humans for gelato and scooters."},
    {"title":"Wish Dragon","clue":"Guy gets dragon who only grants budget-friendly wishes."},
    {"title":"The Emoji Movie","clue":"Emojis discover existential dread inside smartphone."}
  ],
  "Fantasy": [
    {"title":"Harry Potter","clue":"Orphan learns he's famous at a school that violates every safety code."},
    {"title":"Lord of the Rings","clue":"Hiking club returns cursed jewelry to a volcano."},
    {"title":"The Hobbit","clue":"Homebody gets peer-pressured into robbing a dragon."},
    {"title":"The Chronicles of Narnia","clue":"Kids crawl through a closet and join lion politics."},
    {"title":"Wicked","clue":"Green girl gets canceled and takes up gravity."},
    {"title":"The Princess Bride","clue":"Farm boy cosplays pirate to stop a wedding."},
    {"title":"Pan's Labyrinth","clue":"Child escapes fascism with questionable goat mentorship."},
    {"title":"The Golden Compass","clue":"Girl and polar bear expose institutional soul theft."},
    {"title":"Pirates of the Caribbean","clue":"Eccentric pirate ruins the Navy's calendar."},
    {"title":"Mortal Kombat","clue":"Tournament with more fatalities than HR paperwork."},
    {"title":"Power Rangers","clue":"Color-coded teens pilot dinosaur robots for friendship."},
    {"title":"Labyrinth","clue":"Girl regrets wish after meeting glittery goblin rockstar."},
    {"title":"Beetlejuice","clue":"Dead couple hires chaos gremlin to evict the living."},
    {"title":"Edward Scissorhands","clue":"Walking cutlery struggles with suburban boundaries."},
    {"title":"The Wizard of Oz","clue":"Girl commits double homicide via footwear theft."},
    {"title":"Alice in Wonderland","clue":"Girl experiments with snacks and grows personality changes."},
    {"title":"The Shape of Water","clue":"Woman falls for fish; government disapproves."},
    {"title":"The Mummy","clue":"Librarian and himbo unleash a sandstorm boyfriend."},
    {"title":"Percy Jackson","clue":"ADHD teen learns he's half-god, half-homing beacon."},
    {"title":"Dungeons & Dragons","clue":"Party of misfits steals back the MacGuffin, rolls natural 20 on vibes."},
    {"title":"The NeverEnding Story","clue":"Book tries to drown a horse and our childhood."},
    {"title":"Willow","clue":"Small-town sorcerer babysits destiny child."},
    {"title":"The Dark Crystal","clue":"Puppets process trauma with crystals and prophecy."},
    {"title":"Jumanji","clue":"Board game tries to kill a family with jungle hazards."},
    {"title":"Matilda","clue":"Genius girl uses telekinesis to overthrow a tyrannical principal."},
    {"title":"Charlie and the Chocolate Factory","clue":"Oompa Loompas watch as children suffer OSHA violations for candy."},
    {"title":"Hook","clue":"Lawyer remembers he was an orphan who could fly and fight pirates."},
    {"title":"Stardust","clue":"Man catches a falling star and realizes she's a woman who needs protection from witches."},
    {"title":"Night at the Museum","clue":"Security guard discovers that history literally comes alive after dark."},
    {"title":"Maleficent","clue":"The villain was actually the hero who just had a bad breakup."},
    {"title":"Alice Through the Looking Glass","clue":"Girl travels back in time to fix a hatter's family trauma."},
    {"title":"Eragon","clue":"Farm boy finds a blue stone that turns out to be a pet lizard with wings."},
    {"title":"Inkheart","clue":"Man reads books so well that the characters jump out into the real world."},
    {"title":"Nanny McPhee","clue":"Ugly nanny uses magic to discipline unruly children and gets prettier as they behave."},
    {"title":"The School for Good and Evil","clue":"Best friends are sent to the wrong magical boarding schools."},
    {"title":"Big Fish","clue":"Son tries to distinguish fact from fiction in his dying father's tall tales."},
    {"title":"Enchanted","clue":"Cartoon princess gets pushed into a manhole and ends up in New York City."},
    {"title":"Hocus Pocus","clue":"Teenager lights a candle and accidentally summons three hungry witches."},
    {"title":"Practical Magic","clue":"Sisters deal with a family curse and a very persistent dead boyfriend."},
    {"title":"The Craft","clue":"Four teen witches realize that magic has some nasty side effects."},
    {"title":"Gremlins","clue":"Man buys a pet, ignores the feeding schedule, and destroys a town."},
    {"title":"Hellboy","clue":"Demon works for the government and files down his horns to fit in."},
    {"title":"Legend","clue":"Tom Cruise tries to stop a devil from killing the last unicorn."},
    {"title":"Conan the Barbarian","clue":"Man goes on a quest to solve the riddle of steel and avenge his parents."},
    {"title":"Bridge to Terabithia","clue":"Kids build a kingdom in the woods to escape their boring lives until tragedy strikes."},
    {"title":"Clash of the Titans","clue":"Demi-god kills a giant medusa and a sea monster for a princess."},
    {"title":"Splash","clue":"Man falls for a woman who turns into a fish every time she takes a bath."},
    {"title":"The Spiderwick Chronicles","clue":"Family moves into an old house and discovers a field guide to fairies."}
  ],
  
  "SciFi": [
    {"title":"Star Wars: A New Hope","clue":"Farmhand joins space wizard and smuggler to blow up fascist balloon."},
    {"title":"Star Wars: The Empire Strikes Back","clue":"Family therapy session goes badly on a catwalk."},
    {"title":"Star Wars: Return of the Jedi","clue":"Man tries to redeem dad who keeps cutting off hands."},
    {"title":"Star Wars: The Force Awakens","clue":"Girl inherits family drama via lightsaber she didn't ask for."},
    {"title":"Star Wars: The Last Jedi","clue":"Reclusive hero teaches student how to fail professionally."},
    {"title":"Star Wars: The Rise of Skywalker","clue":"Galaxy battles somehow-returned guy with electricity addiction."},
    {"title":"The Matrix","clue":"Office worker takes red pill and learns kung fu immediately."},
    {"title":"The Matrix Reloaded","clue":"Man fights hundreds of clones in a CGI fever dream."},
    {"title":"The Matrix Revolutions","clue":"Chosen one negotiates peace through mutually assured vibes."},
    {"title":"The Matrix Resurrections","clue":"Man gets rebooted by corporate nostalgia."},
    {"title":"Avatar","clue":"Marine goes blueface to steal planet's resources, has change of heart."},
    {"title":"Avatar: The Way of Water","clue":"Family moves to ocean and still can't avoid military exes."},
    {"title":"Jurassic Park","clue":"Theme park ignores OSHA, nature files lawsuit."},
    {"title":"Jurassic World","clue":"Genetically modified lizard says hello by murdering everything."},
    {"title":"Jurassic World: Fallen Kingdom","clue":"Dinosaur rescue mission turns into haunted mansion event."},
    {"title":"Jurassic World: Dominion","clue":"Dinosaurs share screen with killer locusts for some reason."},
    {"title":"Inception","clue":"Man commits corporate espionage via shared dream Airbnb."},
    {"title":"Interstellar","clue":"Pilot travels through wormhole because corn isn't enough anymore."},
    {"title":"Gravity","clue":"Astronaut’s bad day lasts 91 minutes."},
    {"title":"The Martian","clue":"Man grows potatoes out of spite."},
    {"title":"Arrival","clue":"Linguist learns aliens and non-linear pain simultaneously."},
    {"title":"Blade Runner","clue":"Detective questions robots and his own personality settings."},
    {"title":"Blade Runner 2049","clue":"Future cop uncovers conspiracy and crippling self-awareness."},
    {"title":"District 9","clue":"Man turns into prawn and learns empathy the hard way."},
    {"title":"Dune (2021)","clue":"Noble boy joins sand people and discovers he's spiced-up Jesus."},
    {"title":"Dune: Part Two","clue":"Chosen one goes full desert messiah and destabilizes everything."},
    {"title":"Edge of Tomorrow","clue":"Man respawns until competent."},
    {"title":"Elysium","clue":"Man with robot spine breaks into rich people's sky HOA."},
    {"title":"RoboCop","clue":"Dead cop resurrected as corporate blender with badge."},
    {"title":"Terminator","clue":"Robot time-travels to ruin one woman's entire week."},
    {"title":"Terminator 2: Judgment Day","clue":"Robot babysits teen to stop robot apocalypse."},
    {"title":"Terminator: Dark Fate","clue":"Robots persist; humanity does not."},
    {"title":"Transformers","clue":"Alien trucks explode around teen’s dating life."},
    {"title":"Transformers: Revenge of the Fallen","clue":"Robots fight each other and geography loses."},
    {"title":"Transformers: Dark of the Moon","clue":"Moon conspiracy becomes robot turf war."},
    {"title":"Transformers: Age of Extinction","clue":"Robots, dinosaurs, explosions, plot optional."},
    {"title":"Transformers: The Last Knight","clue":"Robots rewrite human history again because why not."},
    {"title":"Guardians of the Galaxy","clue":"Space raccoon and tree save galaxy between bickering."},
    {"title":"Ready Player One","clue":"Boy solves puzzles using 80s nostalgia and zero cardio."},
    {"title":"Her","clue":"Man dates operating system with emotional updates."},
    {"title":"I Am Legend","clue":"Man and dog attempt to out-survive viral Yelp review of humanity."},
    {"title":"Independence Day","clue":"Aliens invade; humanity responds with monologue."},
    {"title":"Pacific Rim","clue":"Giant robots punch giant monsters because drift compatibility."},
    {"title":"The Fifth Element","clue":"Taxi driver escorts perfect being to defeat emo space cloud."},
    {"title":"WALL-E","clue":"Trash robot finds love and accidentally sparks human revolution."},
    {"title":"Ex Machina","clue":"Tech bro tests robot, robot tests humanity, humanity fails."},
    {"title":"Looper","clue":"Hitman fails to kill future self, timeline says 'fine I'll do it'."},
    {"title":"Snowpiercer","clue":"Class warfare but on a train and cold."},
    {"title":"The Hunger Games","clue":"Teen volunteers for violent reality show with terrible sponsors."},
    {"title":"The Hunger Games: Catching Fire","clue":"Girl wins once, punishment is to win again."},
    {"title":"The Hunger Games: Mockingjay","clue":"Propaganda star leads revolution through PTSD."},
    {"title":"Minority Report","clue":"Man arrested for crime he hasn't had coffee for yet."},
    {"title":"Total Recall","clue":"Man's vacation package includes identity crisis."},
    {"title":"Gravity","clue":"Astronaut free-floats through nightmare physics."},
    {"title":"The War of the Worlds","clue":"Aliens invade but forget to update antivirus."},
    {"title":"The Day the Earth Stood Still","clue":"Alien visits Earth, judges us harshly, valid."},
    {"title":"The Adjustment Bureau","clue":"Fate is controlled by men in hats with poor communication skills."},
    {"title":"Star Trek","clue":"Space interns take control of ship during crisis."},
    {"title":"Star Trek Into Darkness","clue":"Crew wakes up ancient man with gym membership."},
    {"title":"Star Trek Beyond","clue":"Ship crashes again; teamwork fixes everything again."},
    {"title":"The Hitchhiker's Guide to the Galaxy","clue":"Earth destroyed for galactic construction project."},
    {"title":"Tron: Legacy","clue":"Son enters neon dad's computer and fights screensavers."},
    {"title":"Oblivion","clue":"Clone janitor learns he's not special and rebels anyway."},
    {"title":"The Island","clue":"Clones escape farm that sells human parts as luxury items."},
    {"title":"The Host","clue":"Parasite takes girl’s body, gets stuck with girl’s opinions."},
    {"title":"Tomorrowland","clue":"Girl visits futuristic utopia with troubling fine print."},
    {"title":"Ender’s Game","clue":"Gifted child commits accidental war crimes for extra credit."}
  ],

  "Superhero": [
    {"title":"Iron Man","clue":"Billionaire builds a pacemaker and accidentally becomes a war machine."},
    {"title":"Iron Man 2","clue":"Man fights electric whip guy while dealing with metal poisoning and ego poisoning."},
    {"title":"Iron Man 3","clue":"Billionaire processes trauma by fighting fire-breathing influencers."},
    {"title":"Captain America: The First Avenger","clue":"Skinny guy takes super serum and starts punching fascism professionally."},
    {"title":"Captain America: The Winter Soldier","clue":"Best friends reunite through espionage and emotional damage."},
    {"title":"Captain America: Civil War","clue":"Friends disagree about paperwork and destroy an airport."},
    {"title":"The Avengers","clue":"Coworkers bond while fighting alien army sent by adopted emo prince."},
    {"title":"Avengers: Age of Ultron","clue":"Robot evolves from Siri to genocidal philosopher."},
    {"title":"Avengers: Infinity War","clue":"Purple environmentalist collects jewelry and halves the universe."},
    {"title":"Avengers: Endgame","clue":"Grief counseling disguised as a time-heist."},
    {"title":"Thor","clue":"Arrogant frat god gets banished to New Mexico."},
    {"title":"Thor: The Dark World","clue":"God fights dark elves nobody remembers."},
    {"title":"Thor: Ragnarok","clue":"God loses hammer, gains haircut, saves people via comedy."},
    {"title":"Thor: Love and Thunder","clue":"Viking processes grief through goats and questionable lighting."},
    {"title":"The Incredible Hulk","clue":"Scientist becomes green gym bro when stressed."},
    {"title":"Black Panther","clue":"King fights cousin over national security and fashion."},
    {"title":"Doctor Strange","clue":"Arrogant surgeon learns magic and abuses time loops."},
    {"title":"Doctor Strange in the Multiverse of Madness","clue":"Wizard battles grieving mom across multiple realities."},
    {"title":"Ant-Man","clue":"Thief shrinks and still can't avoid custody issues."},
    {"title":"Ant-Man and the Wasp","clue":"Ex-con shrinks with partner supervision."},
    {"title":"Ant-Man and the Wasp: Quantumania","clue":"Family gets lost in subatomic Vegas."},
    {"title":"Guardians of the Galaxy Vol. 2","clue":"Found family battles dad who is literally a planet."},
    {"title":"Spider-Man: Homecoming","clue":"Teen fights bird-themed dad of his crush."},
    {"title":"Spider-Man: Far From Home","clue":"Teen gets catfished by a dramatic cosplayer."},
    {"title":"Spider-Man: No Way Home","clue":"Multiverse therapy session for three spider-men."},
    {"title":"Spider-Man 2","clue":"Teen juggles college, bills, and villain with metal octopus limbs."},
    {"title":"Spider-Man 3","clue":"Teen’s emo phase becomes a public hazard."},
    {"title":"The Amazing Spider-Man","clue":"Photographer with lizard issues finds romance."},
    {"title":"The Amazing Spider-Man 2","clue":"Teen faces physics and emotional devastation."},
    {"title":"Batman Begins","clue":"Billionaire trains with ninjas to solve crime with theatrics."},
    {"title":"The Dark Knight","clue":"Billionaire and clown debate ethics through explosions."},
    {"title":"The Dark Knight Rises","clue":"Man recovers from back injury through hope and push-ups."},
    {"title":"The Batman","clue":"Emo detective punches criminals using eyeliner and vengeance."},
    {"title":"Man of Steel","clue":"Alien refugee pulverizes city while learning about humanity."},
    {"title":"Batman v Superman","clue":"Two guys stop fighting because their moms have the same name."},
    {"title":"Justice League","clue":"Coworkers revive dead colleague to fight tall gray man."},
    {"title":"Wonder Woman","clue":"Amazon leaves paradise to punch war in the face."},
    {"title":"Wonder Woman 1984","clue":"Wishful thinking spirals into global crisis."},
    {"title":"Aquaman","clue":"Man unites ocean politics through shirtless diplomacy."},
    {"title":"Aquaman and the Lost Kingdom","clue":"Underwater arguments escalate again."},
    {"title":"Shazam!","clue":"Kid becomes buff adult by yelling at lightning."},
    {"title":"Shazam! Fury of the Gods","clue":"Teens fight angry grandma gods with dragon issues."},
    {"title":"The Flash","clue":"Fastest man alive breaks time like a bad habit."},
    {"title":"Green Lantern","clue":"Pilot receives space ring and immediately misuses it."},
    {"title":"Black Adam","clue":"Ancient guy returns to solve modern problems with lightning punches."},
    {"title":"Deadpool","clue":"Cancer patient turns into murderous meme factory."},
    {"title":"Deadpool 2","clue":"Man adopts angry teen and accidentally builds found family."},
    {"title":"Logan","clue":"Exhausted Canadian tries to protect last good thing in his life."},
    {"title":"X-Men","clue":"Gifted teenagers attend wildly unsafe boarding school."},
    {"title":"X2","clue":"Government raid turns field trip into siege."},
    {"title":"X-Men: The Last Stand","clue":"Mutant cure ignites breakup-level drama."},
    {"title":"X-Men: First Class","clue":"Stylish 60s interns prevent nuclear war and break up forever."},
    {"title":"X-Men: Days of Future Past","clue":"Man time-travels to convince depressed friends not to ruin future."},
    {"title":"X-Men: Apocalypse","clue":"Ancient blue gym bro recruits disaster-prone followers."},
    {"title":"X-Men: Dark Phoenix","clue":"Teammate’s meltdown becomes global hazard."},
    {"title":"Fantastic Four","clue":"Science accident turns group into rock, noodle, flame, and ghost."},
    {"title":"Fantastic Four: Rise of the Silver Surfer","clue":"Shiny surfer warns Earth about giant space eater."},
    {"title":"Venom","clue":"Journalist gains goo roommate with appetite issues."},
    {"title":"Morbius","clue":"Doctor becomes bat-themed meme."},
    {"title":"Hellboy","clue":"Demon with day job fights occult HR violations."},
    {"title":"Hancock","clue":"Superpowered man needs rehab and PR team."},
    {"title":"Kick-Ass","clue":"Teen LARPs vigilante and inspires real chaos."},
    {"title":"The Crow","clue":"Musician returns from dead to settle grievances."},
    {"title":"The Mask","clue":"Bank clerk becomes chaos gremlin with green face."},
    {"title":"Unbreakable","clue":"Man realizes he’s harder to kill than everyone else."},
    {"title":"Glass","clue":"Therapist tries group counseling on superhumans."},
    {"title":"Sky High","clue":"Teen learns his superpower late and still graduates."}
  ],
  "EmotionalDamage": [
    {"title":"Up","clue":"Animated montage emotionally wrecks you before the plot starts."},
    {"title":"Inside Out","clue":"Imaginary friend sacrifices himself to make you ugly-cry."},
    {"title":"Coco","clue":"Kid sings one song and obliterates everyone’s tear ducts."},
    {"title":"Toy Story 3","clue":"Toys accept fiery death together while you clutch tissues."},
    {"title":"Bridge to Terabithia","clue":"Childhood fantasy world becomes grief bootcamp."},
    {"title":"Titanic","clue":"Ship sinks, hearts break, door discourse continues forever."},
    {"title":"The Notebook","clue":"Man rereads love story to wife who no longer remembers him."},
    {"title":"Marley & Me","clue":"Dog teaches chaos and heartbreak in equal measure."},
    {"title":"The Fault in Our Stars","clue":"Teens fall in love between chemo sessions and fate."},
    {"title":"The Green Mile","clue":"Magic man heals others but can't heal his own ending."},
    {"title":"Grave of the Fireflies","clue":"Siblings lose everything except each other, then you suffer."},
    {"title":"A Walk to Remember","clue":"Teen love story smashes into terminal reality."},
    {"title":"P.S. I Love You","clue":"Widow receives postmortem pep talks from dead husband."},
    {"title":"Me Before You","clue":"Love can't overcome the choice that destroys her."},
    {"title":"Hachi: A Dog's Tale","clue":"Dog invents lifelong sorrow at a train station."},
    {"title":"Old Yeller","clue":"Boy faces worst coming-of-age task ever written."},
    {"title":"Bambi","clue":"Hunter ends childhood innocence in one gunshot."},
    {"title":"Manchester by the Sea","clue":"Man returns home and loses the ability to feel again."},
    {"title":"Requiem for a Dream","clue":"Four lives descend into misery at record speed."},
    {"title":"Atonement","clue":"One lie ruins two lives across decades."},
    {"title":"The Lion King","clue":"Kid witnesses father’s death and trauma becomes canon."},
    {"title":"The Time Traveler's Wife","clue":"Marriage built on surprise vanishings and grief."},
    {"title":"The Pursuit of Happyness","clue":"Man hits rock bottom in bathroom before triumphing."},
    {"title":"Million Dollar Baby","clue":"Boxer's grit meets a devastating turn."},
    {"title":"Schindler's List","clue":"Accountant learns saving lives outranks business."},
    {"title":"La La Land","clue":"Two people choose success over each other and ache forever."},
    {"title":"The Iron Claw","clue":"Brothers wrestle fate and lose too much along the way."},
    {"title":"Aftersun","clue":"Daughter remembers vacation that was actually goodbye."},
    {"title":"Past Lives","clue":"Childhood friends confront the universe where they didn’t meet."},
    {"title":"Call Me By Your Name","clue":"Summer romance ends with a fireplace-level breakdown."},
    {"title":"Brokeback Mountain","clue":"Love survives everything except circumstance."},
    {"title":"Moonlight","clue":"Man’s life defined by who he can and cannot love."},
    {"title":"Room","clue":"Mother and son escape captivity and face a bigger world."},
    {"title":"The Whale","clue":"Grieving man tries to reconnect before time runs out."},
    {"title":"The Road","clue":"Father and son walk through the end of the world holding hope."},
    {"title":"Life is Beautiful","clue":"Dad hides horrors behind laughter until he can't anymore."},
    {"title":"A Star is Born","clue":"One career rises while another quietly collapses."},
    {"title":"Seven Pounds","clue":"Man tries to save others to repay an irreversible mistake."},
    {"title":"Fruitvale Station","clue":"One ordinary day ends in devastating reality."},
    {"title":"Sophie's Choice","clue":"Mother is forced into an impossible decision."},
    {"title":"The Boy in the Striped Pyjamas","clue":"Child befriends boy behind the fence—tragedy follows."},
    {"title":"Terms of Endearment","clue":"Mother and daughter fight for decades until time runs out."},
    {"title":"Steel Magnolias","clue":"Friendship carries women through joy and heartbreak."},
    {"title":"Eternal Sunshine of the Spotless Mind","clue":"Man erases ex but realizes memories hurt and heal."},
    {"title":"The Lovely Bones","clue":"Girl watches family grieve from the afterlife."},
    {"title":"Philadelphia","clue":"Lawyer fights injustice while dying slowly."},
    {"title":"The Fox and the Hound","clue":"Two friends learn the world hates their bond."},
    {"title":"Finding Nemo","clue":"Dad spends movie coping with first-scene trauma."},
    {"title":"Inside Out 2","clue":"Puberty upgrades emotions into stabby versions."},
    {"title":"Big Hero 6","clue":"Boy grieves brother by weaponizing a healthcare robot."},
    {"title":"Toy Story 2","clue":"Cowgirl sings abandonment song that punches your soul."},
    {"title":"Toy Story 4","clue":"Toy chooses self-discovery over lifelong friends."},
    {"title":"Soul","clue":"Man learns purpose wasn’t purpose and cries anyway."},
    {"title":"Ratatouille","clue":"Food critic’s flashback derails your emotional control."},
    {"title":"Wall-E","clue":"Robot teaches humanity how to feel again."},
    {"title":"Frozen 2","clue":"Sister confronts generational sins in song form."},
    {"title":"Cinderella","clue":"Girl survives emotional abuse with terrifying optimism."},
    {"title":"Beauty and the Beast","clue":"Woman tries to heal deeply cursed man-child."},
    {"title":"Moana","clue":"Teen faces identity crisis guided by ocean therapy."},
    {"title":"Encanto","clue":"Family learns perfection is emotional imprisonment."},
    {"title":"Lilo & Stitch","clue":"Girl copes with loss by adopting chaos alien."},
    {"title":"The Little Prince","clue":"Boy learns adults forget imagination, joy evaporates."},
    {"title":"Wonder","clue":"Child with facial differences teaches adults humanity."},
    {"title":"My Girl","clue":"Bee trauma scars childhood forever."},
    {"title":"Flipped","clue":"Kids fall in love on entirely different timelines."},
    {"title":"The Perks of Being a Wallflower","clue":"Quiet teen searches for belonging while battling trauma."},
    {"title":"The Outsiders","clue":"Brothers fight poverty until tragedy hits hardest."},
    {"title":"The Farewell","clue":"Family hides terminal diagnosis behind smiles."},
    {"title":"Everything Everywhere All At Once","clue":"Multiverse therapy session for mother and daughter."},
    {"title":"Arrival","clue":"Woman chooses love knowing grief waits at the end."},
    {"title":"The Color Purple","clue":"Women endure cruelty and find strength in sisterhood."},
    {"title":"Selma","clue":"March for justice demands heartbreaking sacrifice."},
    {"title":"Hidden Figures","clue":"Triumph overshadows pain of constant discrimination."},
    {"title":"Slumdog Millionaire","clue":"Trauma becomes game show confession booth."},
    {"title":"The Social Network","clue":"Man builds empire and ends relationship with humanity."},
    {"title":"Tick Tick Boom","clue":"Artist races clock while life unravels."},
    {"title":"Marriage Story","clue":"Couple divorces with surgical emotional accuracy."},
    {"title":"The Theory of Everything","clue":"Love bends but doesn’t break under illness."},
    {"title":"The Imitation Game","clue":"Man saves world but is destroyed for who he loves."},
    {"title":"The Danish Girl","clue":"Transition, love, and suffering intertwine painfully."},
    {"title":"The Curious Case of Benjamin Button","clue":"Love can't outrun backwards time."},
    {"title":"Never Let Me Go","clue":"Kids raised for organs quietly accept doomed lives."},
    {"title":"Her","clue":"Man heals heartbreak through OS who eventually leaves him too."},
    {"title":"Lost in Translation","clue":"Two lonely souls connect briefly and vanish forever."},
    {"title":"The Blind Side","clue":"Found family doesn't fix lifelong wounds."},
    {"title":"Lion","clue":"Boy spends adulthood searching for lost home."},
    {"title":"Coda","clue":"Girl chooses dream knowing family needs her voice."},
    {"title":"Five Feet Apart","clue":"Teens fall in love but must stay apart to survive."},
    {"title":"Dear John","clue":"Long-distance love loses to time and tragedy."},
    {"title":"The Last Song","clue":"Daughter reconnects with dad just in time to lose him."},
    {"title":"Inside Llewyn Davis","clue":"Musician drowns grief in failure and folk music."},
    {"title":"Hustle","clue":"Coach mentors player while burying his own regrets."},
    {"title":"All the Bright Places","clue":"Teens bond over pain, but healing isn’t equal."},
    {"title":"The Sun Is Also a Star","clue":"Teens fall in love hours before immigration crisis."},
    {"title":"A Monster Calls","clue":"Boy faces grief through storytelling tree therapy."},
    {"title":"Boy Erased","clue":"Conversion therapy becomes a trauma chamber."},
    {"title":"The Kite Runner","clue":"Childhood betrayal haunts lifetime."},
    {"title":"Dead Poets Society","clue":"Inspiration meets tragedy in a classroom."},
    {"title":"Good Will Hunting","clue":"Genius admits it’s not his fault and breaks you."},
    {"title":"Field of Dreams","clue":"Dad and son reconnect too late through magic."},
    {"title":"Cast Away","clue":"Man loses everything, including volleyball best friend."},
    {"title":"The Truman Show","clue":"Man learns life was a televised lie."},
    {"title":"Forrest Gump","clue":"Life blesses and breaks him repeatedly."},
    {"title":"Green Book","clue":"Musician endures racism while forming fragile bond."},
    {"title":"Selena","clue":"Rising star's life stolen far too soon."},
    {"title":"Cinderella Man","clue":"Boxer fights poverty harder than opponents."},
    {"title":"The Impossible","clue":"Family survives tsunami but trauma lingers."},
    {"title":"The Last Samurai","clue":"Soldier finds purpose and loses everything in war."},
    {"title":"Hunger Games","clue":"Trauma becomes national entertainment."},
    {"title":"The Boy Who Harnessed the Wind","clue":"Child saves village at emotional cost."},
    {"title":"One Day","clue":"Couple meets yearly until fate ends tradition."}
  ],

  "StreamingHits": [
    {"title":"Squid Game","clue":"Adults play childhood games with lethal penalties."},
    {"title":"Bird Box","clue":"Apocalypse where eye contact becomes hazardous."},
    {"title":"Red Notice","clue":"Celebrities steal art, diamonds, and Netflix budgets."},
    {"title":"Don't Look Up","clue":"Comet threatens Earth, society shrugs."},
    {"title":"Glass Onion","clue":"Detective unravels mystery on tech bro’s island retreat."},
    {"title":"The Gray Man","clue":"Two handsome men globally punch each other."},
    {"title":"Enola Holmes","clue":"Sherlock’s sister solves crimes with chaotic charm."},
    {"title":"Extraction","clue":"Babysitting job escalates into grenade choreography."},
    {"title":"Hustle","clue":"Scout turns longshot into highlight reel."},
    {"title":"Klaus","clue":"Postal worker rebrands kindness as logistics."},
    {"title":"The Mitchells vs. The Machines","clue":"Family road trip interrupts robot uprising."},
    {"title":"Marriage Story","clue":"Co-parents speedrun heartbreak and litigation."},
    {"title":"Roma","clue":"Housekeeper quietly holds family together."},
    {"title":"Always Be My Maybe","clue":"Childhood crushes collide in adult chaos."},
    {"title":"The Old Guard","clue":"Immortal mercenaries struggle with HR and history."},
    {"title":"Tick Tick Boom","clue":"Playwright races mortality with sheet music."},
    {"title":"Hamilton","clue":"Founding Fathers rap through revolution and drama."},
    {"title":"Soul","clue":"Jazz musician negotiates with the afterlife."},
    {"title":"Turning Red","clue":"Teen hits puberty and becomes a giant red panda."},
    {"title":"Luca","clue":"Sea kids pass as human for gelato."},
    {"title":"Encanto","clue":"Family therapy disguised as musical magic."},
    {"title":"The Boys","clue":"Heroes act like influencers with body counts."},
    {"title":"Palm Springs","clue":"Wedding guest stuck in loop learns self-improvement."},
    {"title":"Prey","clue":"Predator meets formidable opponent with actual skills."},
    {"title":"CODA","clue":"Daughter’s dream clashes with family dependence."},
    {"title":"Leave the World Behind","clue":"Families bicker during civilization’s quiet collapse."},
    {"title":"Society of the Snow","clue":"Team discovers extreme diet via survival horror."},
    {"title":"Rebel Moon","clue":"Farmers hire mercenaries against space empire."},
    {"title":"Extraction 2","clue":"Babysitter returns for prison break edition."},
    {"title":"Heart of Stone","clue":"Agent protects world-controlling AI from hacker."},
    {"title":"The Killer","clue":"Assassin botches job, begins violent apology tour."},
    {"title":"Maestro","clue":"Composer’s genius clashes with messy love life."},
    {"title":"Rustin","clue":"Leader plans historic march while battling opposition."},
    {"title":"Nimona","clue":"Shape-shifter aids framed knight with attitude and axes."},
    {"title":"Leo","clue":"70-year-old lizard wants out of classroom tank life."},
    {"title":"Orion and the Dark","clue":"Anxious boy befriends his literal fear."},
    {"title":"The Irishman","clue":"Hitman reflects on painting houses for the mob."},
    {"title":"The Power of the Dog","clue":"Cowboy bullies until karma arrives in quiet form."},
    {"title":"The Trial of the Chicago 7","clue":"Courtroom becomes political battlefield."},
    {"title":"Mank","clue":"Writer battles Hollywood and alcohol to finish script."},
    {"title":"Crip Camp","clue":"Disabled teens start civil rights movement from summer camp."},
    {"title":"My Octopus Teacher","clue":"Man befriends octopus and questions everything."},
    {"title":"Squid Game: The Challenge","clue":"Real contestants try to win minus the fatalities."},
    {"title":"Beef","clue":"Road rage escalates into life-collapse art piece."},
    {"title":"Fair Play","clue":"Couple’s relationship implodes over one promotion."},
    {"title":"Luther: The Fallen Sun","clue":"Detective escapes prison to stop cyber-killer."},
    {"title":"The Wonderful Story of Henry Sugar","clue":"Man learns to see without eyes to cheat at cards."},
    {"title":"One Day","clue":"Couple meets yearly for decades of longing."},
    {"title":"Spaceman","clue":"Astronaut counsels with giant space spider about marriage."},
    {"title":"Stranger Things","clue":"Kids fight demons powered by 80s nostalgia."},
    {"title":"The Mandalorian","clue":"Warrior adopts green toddler, becomes space dad."},
    {"title":"Game of Thrones","clue":"Families wage war for uncomfortable metal chair."},
    {"title":"House of the Dragon","clue":"Royal family tree is more like a circle."},
    {"title":"Friends","clue":"Group never locks doors for a decade."},
    {"title":"The Office","clue":"Boss commits HR violations daily with sincerity."},
    {"title":"Parks and Recreation","clue":"Optimist battles bureaucracy with binders."},
    {"title":"How I Met Your Mother","clue":"Nine-season story about wrong woman."},
    {"title":"The Last of Us","clue":"Grumpy man escorts immune teen through fungus hell."},
    {"title":"The Witcher","clue":"Grumpy man grunts his way through monster gigs."},
    {"title":"Euphoria","clue":"Teens experience adulthood too fast, too sparkly."},
    {"title":"The Morning Show","clue":"News anchors juggle trauma and ratings."},
    {"title":"Ted Lasso","clue":"Coach solves soccer with kindness and dad jokes."},
    {"title":"Severance","clue":"Work-life balance becomes surgery."},
    {"title":"Silo","clue":"Earth surface uninhabitable; basement politics thrive."},
    {"title":"Foundation","clue":"Empire collapses slower than show releases episodes."},
    {"title":"Monarch: Legacy of Monsters","clue":"Family unpacks century of kaiju trauma."},
    {"title":"Invincible","clue":"Teen learns dad is catastrophic supervillain."},
    {"title":"Reacher","clue":"Walking tank solves crimes with fists."},
    {"title":"Jack Ryan","clue":"Analyst saves world between emails."},
    {"title":"Citadel","clue":"Agents with amnesia rediscover past chaos."},
    {"title":"Wednesday","clue":"Goth teen solves mysteries using deadpan perfection."},
    {"title":"The Crown","clue":"Monarchy doubles as generational therapy."},
    {"title":"Bridgerton","clue":"Regency gossip blog controls everyone's hormones."},
    {"title":"Queen Charlotte","clue":"Monarch navigates love and looming madness."},
    {"title":"Daisy Jones & The Six","clue":"Band drama disguised as documentary."},
    {"title":"Boardwalk Empire","clue":"Alcohol and crime fuel Prohibition drama."},
    {"title":"Succession","clue":"Rich family battles for power and Dad’s approval."},
    {"title":"Barry","clue":"Hitman pursues acting; neither goes smoothly."},
    {"title":"True Detective","clue":"Detectives solve crimes while confronting life trauma."},
    {"title":"Breaking Bad","clue":"Teacher becomes meth king because healthcare sucks."},
    {"title":"Better Call Saul","clue":"Lawyer descends into crime stylishly and slowly."},
    {"title":"Peaky Blinders","clue":"Family crime saga powered by hats and cigarettes."},
    {"title":"The Handmaid's Tale","clue":"Oppression becomes mandatory dress code."},
    {"title":"The Bear","clue":"Chef survives chaos with culinary panic."},
    {"title":"Only Murders in the Building","clue":"Neighbors solve murder through podcasting."},
    {"title":"The Good Place","clue":"Dead woman learns ethics the hard way."},
    {"title":"Loki","clue":"God of Mischief trapped in time-travel bureaucracy."},
    {"title":"WandaVision","clue":"Grieving woman holds town hostage via sitcom."},
    {"title":"Moon Knight","clue":"Man with multiple personalities fights gods."},
    {"title":"The Falcon and the Winter Soldier","clue":"Two men do couples therapy with a shield."},
    {"title":"Hawkeye","clue":"Retired hero mentors chaotic fangirl at Christmas."},
    {"title":"Ahsoka","clue":"Jedi fights fascism across multiple galaxies."},
    {"title":"Obi-Wan Kenobi","clue":"Teacher confronts ex-student with lava issues."},
    {"title":"Andor","clue":"Man becomes rebel icon through reluctant competence."},
    {"title":"The Book of Boba Fett","clue":"Bounty hunter retires into small-town politics."},
    {"title":"The Umbrella Academy","clue":"Adopted siblings save world badly."},
    {"title":"The Queen's Gambit","clue":"Orphan masters chess despite trauma and tranquilizers."},
    {"title":"The Lincoln Lawyer","clue":"Attorney solves crimes from his sedan."},
    {"title":"Emily in Paris","clue":"Influencer survives France through outfits alone."},
    {"title":"Outer Banks","clue":"Teens chase treasure instead of responsibilities."},
    {"title":"Virgin River","clue":"Town where everyone falls in love and cries."},
    {"title":"Gilmore Girls","clue":"Mother-daughter duo powered by caffeine and drama."},
    {"title":"Love Is Blind","clue":"People propose without seeing each other, chaos ensues."},
    {"title":"Selling Sunset","clue":"Realtors battle using passive-aggressive couture."},
    {"title":"The Marvelous Mrs. Maisel","clue":"Housewife becomes comic, takes down patriarchy."},
    {"title":"Fleabag","clue":"Woman self-destructs gracefully while breaking fourth wall."},
    {"title":"The Grand Tour","clue":"Three men insult cars across continents."},
    {"title":"The Terminal List","clue":"Soldier uncovers conspiracy with maximum chin energy."},
    {"title":"Yellowstone","clue":"Family defends ranch with cowboy chaos."},
    {"title":"Mayor of Kingstown","clue":"Man negotiates between gangs and police with stress."},
    {"title":"Tulsa King","clue":"Aging gangster runs Oklahoma like summer camp."},
    {"title":"Halo","clue":"Super soldier removes helmet, reveals feelings."},
    {"title":"Fallout","clue":"Vault dweller explores apocalypse with cheerful violence."},
    {"title":"The Wheel of Time","clue":"Magic war fights Amazon scheduling."},
    {"title":"The Gentlemen","clue":"Rich boy inherits crime empire and vibes."},
    {"title":"K-Pop Demon Hunters","clue":"Idol group fights demons instead of bad contracts."}
  ]
}
